# Agenda

- Group By Continued

- Merge

- Some useful functions and properties

    - drop (axis)  - df.drop('col',axis = 1)
    - info - deatails about data - df.info()
    - describe - df.describe() - min, max, mean, median, count
    - isnull - true or false if null
    - fillna - df.fillna(-1)
    
    - index df.index deatils about index
    - columns - df.columns - gives list of all columns
    
    - values - fetches values either by a column or on while dataframe
    - sort_values - sorts the whole dataframe
    
    - loc and iloc

# Group By Example

In [1]:
import pandas as pd

In [2]:
data = {'students':['ram','shyam'] * 3,
        'scores':list(range(50,80,5)),
        'subjects':['science','science'] * 2 + ['maths'] * 2,
        'parts':['practicle','theory'] * 2 + [''] * 2
        }

scores = pd.DataFrame(data)
scores

  students  scores subjects      parts
0      ram      50  science  practicle
1    shyam      55  science     theory
2      ram      60  science  practicle
3    shyam      65  science     theory
4      ram      70    maths
5    shyam      75    maths

In [3]:
# [row_start:row_end, col_start:col_end]
scores.iloc[2:4,1:3]

   scores subjects
2      60  science
3      65  science

In [4]:
scores.loc[2:4,'scores':'subjects']

   scores subjects
2      60  science
3      65  science
4      70    maths

In [5]:
scores

  students  scores subjects      parts
0      ram      50  science  practicle
1    shyam      55  science     theory
2      ram      60  science  practicle
3    shyam      65  science     theory
4      ram      70    maths
5    shyam      75    maths

In [6]:
scores.sort_values('scores', ascending=False)

  students  scores subjects      parts
5    shyam      75    maths
4      ram      70    maths
3    shyam      65  science     theory
2      ram      60  science  practicle
1    shyam      55  science     theory
0      ram      50  science  practicle

In [8]:
scores.values

array([['ram', 50, 'science', 'practicle'],
       ['shyam', 55, 'science', 'theory'],
       ['ram', 60, 'science', 'practicle'],
       ['shyam', 65, 'science', 'theory'],
       ['ram', 70, 'maths', ''],
       ['shyam', 75, 'maths', '']], dtype=object)

In [9]:
scores.students.values

array(['ram', 'shyam', 'ram', 'shyam', 'ram', 'shyam'], dtype=object)

In [10]:
scores.index

RangeIndex(start=0, stop=6, step=1)

In [11]:
scores.columns

Index(['students', 'scores', 'subjects', 'parts'], dtype='object')

In [12]:
# find out total marks scored by each student

In [13]:
scores.groupby('students').sum()

          scores
students
ram          180
shyam        195

In [14]:
# find out for each student the total marks in each subject

In [15]:
scores.groupby(['students','subjects']).sum()

                   scores
students subjects
ram      maths         70
         science      110
shyam    maths         75
         science      120

# merge

In [17]:
left_dataframe = pd.DataFrame({'ID':[1,2,3,4], "data_left":"Science"})
right_dataframe = pd.DataFrame({'ID':[3,4,5,6], "data_right":"Arts"})

In [18]:
left_dataframe

   ID data_left
0   1   Science
1   2   Science
2   3   Science
3   4   Science

In [19]:
right_dataframe

   ID data_right
0   3       Arts
1   4       Arts
2   5       Arts
3   6       Arts

In [20]:
# inner - only common data
# pd.merge(left_dataframe, right_dataframe, how='inner')
pd.merge(left_dataframe, right_dataframe)

   ID data_left data_right
0   3   Science       Arts
1   4   Science       Arts

In [21]:
pd.merge(left_dataframe, right_dataframe, how='outer')

   ID data_left data_right
0   1   Science        NaN
1   2   Science        NaN
2   3   Science       Arts
3   4   Science       Arts
4   5       NaN       Arts
5   6       NaN       Arts

In [22]:
pd.merge(left_dataframe, right_dataframe, how='left')

   ID data_left data_right
0   1   Science        NaN
1   2   Science        NaN
2   3   Science       Arts
3   4   Science       Arts

In [23]:
pd.merge(left_dataframe, right_dataframe, how='right')

   ID data_left data_right
0   3   Science       Arts
1   4   Science       Arts
2   5       NaN       Arts
3   6       NaN       Arts